# 📘 Pandas 복습 문제

아래는 오늘 학습한 내용을 복습할 수 있는 문제입니다.

### 1. Pandas란 무엇이며, 데이터 엔지니어가 왜 Pandas를 사용해야 하는지 서술하세요.

데이터엔지니어는 대량의 데이터를 수집, 정제, 가공하는 역할을 맡습니다. 이 과정에서 데이터를 표 형태로 다루는 일이 매우 많은데, Pandas는 이 과정을 빠르고 쉽게 처리할 수 있도록 도와주는 필수 도구입니다.

예를들어: CSV, EXECL, SQL 등 다양한 소스의 데이터를 불러와 가공
결측값 처리, 열/행 추가 및 삭제, 인덱싱 등 데이터 전처리
통계 요약, 그룹화 필터링 등 분석 전처리 단계에 쓰입니다

결국 Pandas는 데이터를 엑셀처럼 쉽게 다룰 수 있게 도와주는 파이썬 도구 입니다.

### 2. Series와 DataFrame의 차이를 표로 정리해보세요.

Series는 일렬로 정리된 데이터 즉, 1차원 데이터이고 DataFrame은 행과 열로 이루어진 2차원 데이터 입니다.

### 3. 다음 리스트를 Series로 변환하는 코드를 작성하세요.
   data = [10, 20, 30, 40]

In [12]:
data1 = [10, 20, 30, 40]

import pandas as pd

dt = pd.Series(data1)

type(dt)

pandas.core.series.Series

### 4. 다음과 같은 딕셔너리를 이용하여 Series를 생성하는 코드를 작성하세요.
   data = {'a': 1, 'b': 2, 'c': 3}

In [13]:
data_3 = {'a': 1, 'b': 2, 'c': 3}

dt2 = pd.Series(data_3)

dt2

a    1
b    2
c    3
dtype: int64

### 5. 다음 데이터를 이용해 DataFrame을 생성하고, 열 이름을 '이름', '나이', '성적'으로 설정하세요.
   data = [['영희', 23, 90], ['철수', 25, 85], ['민수', 21, 78]]

In [14]:
dt_1 = [['영희', 23, 90], ['철수', 25, 85], ['민수', 21, 78]]

dt3 = pd.DataFrame(dt_1, columns=['이름','나이','성적'])
dt3

   이름  나이  성적
0  영희  23  90
1  철수  25  85
2  민수  21  78

### 6. DataFrame에서 처음 3개의 행만 출력하는 코드를 작성하세요.

In [15]:
dt3.loc[3] = ['지훈',31,100]

In [16]:
dt3.iloc[:3,:]

   이름  나이  성적
0  영희  23  90
1  철수  25  85
2  민수  21  78

In [17]:
dt3.iloc[[0,1,2],:] #인덱싱 할 거면 괄호!!! 슬라이싱할거면 괄호 없이

   이름  나이  성적
0  영희  23  90
1  철수  25  85
2  민수  21  78

In [18]:
dt3.iloc[0:3,:]

   이름  나이  성적
0  영희  23  90
1  철수  25  85
2  민수  21  78

### 7. DataFrame의 구조(행/열 수, 열별 데이터 타입 등)를 확인하는 방법을 코드로 작성하세요.

In [21]:
dt3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      4 non-null      object
 1   나이      4 non-null      int64
 2   성적      4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 128.0+ bytes

### 8. DataFrame에서 '나이' 열만 선택하는 코드를 작성하세요.

In [23]:
dt3.iloc[:,1]

0    23
1    25
2    21
3    31
Name: 나이, dtype: int64

### 9. '나이'가 23세 이상인 사람들만 출력하는 코드를 작성하세요.

In [24]:
dt3[dt3['나이']>=23]

   이름  나이   성적
0  영희  23   90
1  철수  25   85
3  지훈  31  100

### 10. DataFrame에 '성별' 열을 추가하고, ['여', '남', '남'] 데이터를 입력하는 코드를 작성하세요.

In [31]:
dt3['성별'] = ['여', '남', '남','남'] 
dt3.insert(loc=4, column='반', value=['1반','1반','2반','2반'])

In [32]:
dt3

   이름  나이   성적 성별   반
0  영희  23   90  여  1반
1  철수  25   85  남  1반
2  민수  21   78  남  2반
3  지훈  31  100  남  2반

### 11. DataFrame에서 '성적' 열을 삭제하는 코드를 작성하세요.

In [35]:
dt3.drop('성적',axis=1)

   이름  나이 성별   반
0  영희  23  여  1반
1  철수  25  남  1반
2  민수  21  남  2반
3  지훈  31  남  2반

### 12. DataFrame의 인덱스를 ['1반', '2반', '3반']으로 변경하는 코드를 작성하세요.

In [37]:
dt3.rename({0:'1반',1:'2반',2:'3반',3:'4반'})

    이름  나이   성적 성별   반
1반  영희  23   90  여  1반
2반  철수  25   85  남  1반
3반  민수  21   78  남  2반
4반  지훈  31  100  남  2반

### 13. '철수'의 성적을 95점으로 수정하는 코드를 작성하세요 (loc 또는 iloc 사용).

In [41]:
dt3.iloc[1,2] = [95]

In [42]:
dt3

   이름  나이   성적 성별   반
0  영희  23   90  여  1반
1  철수  25   95  남  1반
2  민수  21   78  남  2반
3  지훈  31  100  남  2반

### 14. DataFrame의 모든 수치형 열에 대해 평균을 구하는 코드를 작성하세요.

In [48]:
dt3.iloc[:,1:3].mean()

나이    25.00
성적    90.75
dtype: float64

### 15. '2025-01-01'부터 일주일치 날짜 인덱스를 생성하고 이를 DataFrame의 인덱스로 설정하는 코드를 작성하세요.

In [ ]:
data2 = pd.date_range(2025-1-1,periods=4,freq='d')

In [51]:
data2

dt3['날짜'] = data2

In [ ]:
dt3[:,5].rou

   이름  나이   성적 성별   반                            날짜
0  영희  23   90  여  1반 1970-01-01 00:00:00.000002023
1  철수  25   95  남  1반 1970-01-02 00:00:00.000002023
2  민수  21   78  남  2반 1970-01-03 00:00:00.000002023
3  지훈  31  100  남  2반 1970-01-04 00:00:00.000002023

In [59]:
dt3 = dt3.drop('날짜',axis=1)

In [56]:
data3 = data2.date

In [ ]:
data3

array([datetime.date(1970, 1, 1), datetime.date(1970, 1, 2),
       datetime.date(1970, 1, 3), datetime.date(1970, 1, 4)], dtype=object)

In [60]:
dt3.insert(loc=5,column='날짜',value=data3)

In [61]:
dt3

   이름  나이   성적 성별   반          날짜
0  영희  23   90  여  1반  1970-01-01
1  철수  25   95  남  1반  1970-01-02
2  민수  21   78  남  2반  1970-01-03
3  지훈  31  100  남  2반  1970-01-04